IDENTIFICATION DIVISION.
PROGRAM-ID. READFILE.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT INFILE ASSIGN TO 'input.txt'
    ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD INFILE.
01 INREC PIC X(80).

WORKING-STORAGE SECTION.
01 EOF PIC X VALUE 'N'.

PROCEDURE DIVISION.
    OPEN INPUT INFILE
    READ INFILE
        AT END MOVE 'Y' TO EOF
    END-READ

    PERFORM UNTIL EOF = 'Y'
        DISPLAY INREC
        READ INFILE
            AT END MOVE 'Y' TO EOF
        END