IDENTIFICATION DIVISION.
PROGRAM-ID. ACCEPT-DISPLAY.

ENVIRONMENT DIVISION.

DATA DIVISION.

WORKING-STORAGE SECTION.
01  INPUT-STRING PIC X(20).

PROCEDURE DIVISION.
    DISPLAY 'Enter a string: ' WITH NO ADVANCING.
    ACCEPT INPUT-STRING.
    DISPLAY 'The entered string is: ' INPUT-STRING.
    STOP RUN.

